// Тестирование

// Jest

// Методы(их много)

// 1.toBe - вохвращает тру или фолс
// 2.toEqual - cравнение по значению
// 3.Truthiness - проверка на null undefined true false
// 4.toContain - перебирает весь массив и ищет нужный элемент

// Testing Asynchronus Code

// 3 подхода:

// 1.Callbacks
// 2.Promises
// 3.Async/Await

// Подходы тестирование UI компонентов

// 1.Снимки - это запечатления визуального отображения компонента(как он выглядит и как он должен выглядеть)
// 2.Тестирования логики - 

//Нельзя проверить на тип данных с помощью Jest

//Jest-extended